name: "classifier_onnx"
platform: "onnxruntime_onnx"
max_batch_size: 0
input [
  {
    name: "image_input"
    data_type: TYPE_FP32
    #format: FORMAT_NCHW
    dims: [ 1, 3, 224, 224 ]
    #reshape { shape: [ 1, 3, 224, 224 ] }
  }
]
output [
  {
    name: "scores"
    data_type: TYPE_FP32
    dims: [ 1, 1000 ]
    #reshape { shape: [ 1, 1000, 1, 1 ] }
    #label_filename: "labels.txt"
  }
]
